# Дано натуральное число n. Выведите все числа от 1 до n. Без использования циклов.

N = 50
print(*range(N))
