# Создайте класс с именем Person, содержащий три поля для хранения имени, фамилии и отчества.
# В классе создайте функцию show_data(), выводящую на экран имя, фамилию и отчество.
# Далее от класса Person с помощью наследования создайте два класса: Student, Professor.
# К классу Student добавьте дополнительное поле, содержащее средний бал студента. К классу Professor три поля:
#
# число публикаций профессора,
# должность (тип - перечисление) - преподаватель, старший преподаватель, доцент, профессор,
# возраст. Для каждого производного класса переопределите метод show_data(). В основной программе определите массив.
# Далее в цикле нужно организовать ввод студентов и профессоров вперемешку. Когда ввод будет закончен,
# нужно вывести информацию с помощью метода show_data() обо всех людях.
