# Вывести на экран таблицу умножения на 3.

for v in range(0, 100):
    print('3 *', v, '=', 3*v)

