# Вывести на экран числа от 1 до 5. Результат:
# 1 2 3 4 5

i = 1
while i < 6:
    print(i, end=' ')
    i += 1
