# Вывести на экран таблицу умножения на 3.

for v in range(1, 10):
    print('3 *', v, '=', 3 * v)
