# 1. Вычислить модуль числа без использования библиотечных функций.

number = int(input('Введите число: '))
if number < 0:
    number = -number

print(number)
